// ? https://www.codewars.com/kata/57f22b0f1b5432ff09001cab
// * Колодец идей - более сложная версия
// На каждую хорошую идею ката, кажется, найдется довольно много плохих!
// В этом ката вам нужно проверить предоставленный двумерный массив (x) на наличие хороших идей «хороших» и плохих идей «плохих».
// Если есть одна или две хорошие идеи, верните «Опубликовать!», Если их больше двух, верните «Я чувствую запах серии!».
// Если хороших идей нет, как это часто бывает, верните «Fail!».
// Подмассивы могут быть разной длины.
// Решение должно быть нечувствительным к регистру (т.е. хорошее, хорошее и хорошее - все считается хорошей идеей).
// Все входные данные не могут быть строковыми
