// ? https://www.codewars.com/kata/5a2fd38b55519ed98f0000ce
// * Таблица умножения числа
// Ваша цель - вернуть таблицу умножения для числа, которое всегда является целым числом от 1 до 10.
// Например, таблица умножения (строка) для числа == 5 выглядит так:
// 1 * 5 = 5
// 2 * 5 = 10
// 3 * 5 = 15
// 4 * 5 = 20
// 5 * 5 = 25
// 6 * 5 = 30
// 7 * 5 = 35
// 8 * 5 = 40
// 9 * 5 = 45
// 10 * 5 = 50
// P. S. Вы можете использовать \ n в строке, чтобы перейти к следующей строке.
// Примечание: новые строки следует добавлять между строками, но в конце не должно быть конечных символов новой строки.
