// * https://www.codewars.com/kata/57ebdf1c2d45a0ecd7002cd5
// ! Струны наизнанку
// Вам дается строка слов (x), для каждого слова в строке вам нужно вывернуть слово «наизнанку».
// Под этим я подразумеваю, что внутренние буквы будут выдвигаться, а внешние буквы двигаться к центру.
// Если слово четной длины, все буквы переместятся. Если длина нечетная, ожидается, что вы оставите «среднюю» букву слова на месте.
// Пример должен прояснить:
// «такси» превратилось бы в «atix» «такси» превратилось бы в «atxsi»
