// ! https://www.codewars.com/kata/5a0b72484bebaefe60001867
// * Расстояние между двумя точками
// Запрограммируйте функцию distance (p1, p2), которая возвращает расстояние между точками p1 и p2 в n-мерном пространстве. p1 и p2 будут представлены в виде массивов.
// Ваша программа должна работать для массивов любой длины и должна возвращать -1, если массивы не одинаковой длины или если оба массива являются пустыми наборами.
// Если вы не знаете, как измерить расстояние между двумя точками, перейдите сюда:
// http://mathworld.wolfram.com/Distance.html
